// คำถามแบบ 6 ฐาน (ไม่มีช่วงที่ 1)
export const phase2Bases = [
  {
    id: "base1",
    title: "ฐาน 1",
    questions: [
      {
        id: "1.1",
        label:
          "บทบาทและหน้าที่ของคุณคืออะไร ลองอธิบายสั้นๆให้เราฟัง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base2",
    title: "ฐาน 2",
    questions: [
      {
        id: "2.1",
        label:
          "ปัญหาและอุปสรรค ที่คุณพบเจอในการทำงานช่วงเลือกตั้งมีอะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base3",
    title: "ฐาน 3",
    questions: [
      {
        id: "3.1",
        label:
          "พรรคควรทำงานกับท้องถิ่นอย่างไรในระยะสั้นและระยะยาว เพื่อให้สามารถชนะในการเลือกตั้งครั้งหน้าได้",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "3.2",
        label:
          "ทีมท้องถิ่นควรเพิ่มบทบาทการทำงานในด้านใดบ้างในระยะสั้นและระยะยาว เพื่อให้นำไปสู่การชนะการเลือกตั้งครั้งหน้า",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base4",
    title: "ฐาน 4",
    questions: [
      {
        id: "4.1",
        label:
          "บทบาทและหน้าที่ของคุณคืออะไร ลองอธิบายสั้นๆให้เราฟัง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base5",
    title: "ฐาน 5",
    questions: [
      {
        id: "5.1",
        label: "ปัญหาและอุปสรรค ที่คุณพบเจอในการทำงานมีอะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base6",
    title: "ฐาน 6",
    description:
      "หากต้องการพัฒนาการทำงานให้มีประสิทธิภาพมากขึ้นในระยะสั้นและระยะยาว ควรทำอะไรบ้างกับ 4 ส่วนดังนี้",
    questions: [
      {
        id: "6.1",
        label: "ทีมงานของตัวเอง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.2",
        label: "ทีมนโยบายท้องถิ่นของพรรค",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.3",
        label: "สส. ในพื้นที่",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.4",
        label: "ทีมจังหวัด",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  }
];
