// คำถามแบบ 6 ฐาน (ไม่มีช่วงที่ 1)
export const phase2Bases = [
  {
    id: "base1",
    title: "ฐาน 1",
    questions: [
      {
        id: "1.1",
        label:
          "บทบาทและหน้าที่ของคุณช่วงเลือกตั้งทำอะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base2",
    title: "ฐาน 2",
    questions: [
      {
        id: "2.1",
        label:
          "ปัญหาและอุปสรรค ที่คุณพบเจอในการทำงานช่วงเลือกตั้งมีอะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base3",
    title: "ฐาน 3",
    questions: [
      {
        id: "3.1",
        label:
          "พรรคต้องเพิ่มการทำงานอะไรทั้งในระยะสั้นและระยะยาว เพื่อให้สามารถชนะการเลือกตั้งครั้งหน้าได้",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "3.2",
        label:
          "ท้องถิ่นต้องเพิ่มการทำงานอะไรทั้งในระยะสั้นและระยะยาว เพื่อให้สามารถชนะการเลือกตั้งครั้งหน้าได้",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base4",
    title: "ฐาน 4",
    questions: [
      {
        id: "4.1",
        label:
          "บทบาทและหน้าที่ของคุณที่ผ่านมาในการทำงานระดับท้องถิ่นคืออะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base5",
    title: "ฐาน 5",
    questions: [
      {
        id: "5.1",
        label: "ปัญหาและอุปสรรค ที่คุณพบเจอในการทำงานมีอะไรบ้าง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  },
  {
    id: "base6",
    title: "ฐาน 6",
    description:
      "หากต้องการพัฒนาการทำงานท้องถิ่นให้ดียิ่งขึ้น มีอะไรต้องทำร่วมกับ 4 กลุ่มดังต่อไปนี้",
    questions: [
      {
        id: "6.1",
        label: "ทีมงานตัวเอง",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.2",
        label: "ทีมงานจังหวัดของพรรค",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.3",
        label: "ทีมสส./ผู้สมัคร",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
      {
        id: "6.4",
        label: "ทีมงานท้องถิ่น/พรรค",
        placeholder: "กรุณาเขียนความคิดเห็น...",
      },
    ],
  }
];
